Project/Toir/src/Documents/торо_УстановкаКоэффициентовРемонтныхОсобенностей/торо_УстановкаКоэффициентовРемонтныхОсобенностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_УстановкаКоэффициентовРемонтныхОсобенностей</name>
  <registerRecords>InformationRegister.торо_ЗначенияКоэффициентовРемонтныхОсобенностей</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыРемонта</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
        <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КоэффициентыРемонтныхОсобенностей</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
        <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКоэффициента</name>
      <type>
        <types>CatalogRef.торо_ВидыКоэффициентовРемонтныхОсобенностей</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеКоэффициента</name>
      <type>
        <types>CatalogRef.торо_ЗначенияКоэффициентовРемонтныхОсобенностей</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаИспользования</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РаспространятьНаПодчиненных</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Иерархия</name>
      <type>
        <types>CatalogRef.торо_СтруктурыОР</types>
      </type>
    </attributes>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КоэффициентыРемонтныхОсобенностейПодчиненных</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
        <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКоэффициента</name>
      <type>
        <types>CatalogRef.торо_ВидыКоэффициентовРемонтныхОсобенностей</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеКоэффициента</name>
      <type>
        <types>CatalogRef.торо_ЗначенияКоэффициентовРемонтныхОсобенностей</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаИспользования</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РодительИерархии</name>
      <comment>Предназначен для определения иерархии для структуры которой будет распространятся наработка.</comment>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ОсновноеИмяПользователяAD</name>
    <comment>TOIR20-731</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Catalogs/торо_СписокОбъектовРегламентногоМероприятия/торо_СписокОбъектовРегламентногоМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_СписокОбъектовРегламентногоМероприятия</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИндивидуальноеОбслуживаниеОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Documents/торо_УстановкаКоэффициентовРемонтныхОсобенностей/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			
			Объект.Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнаяОрганизация",
			Истина);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Подразделение) Тогда
			
			Объект.Подразделение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновноеПодразделение",
			Истина);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
			
			Объект.Ответственный = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнойОтветственный",
			Справочники.Пользователи.ПустаяСсылка());
			
		КонецЕсли;
	КонецЕсли;
	
	ТекСтруктураИерархии = 	ТекСтруктураИерархии = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнаяСтруктураИерархии",
			Истина);

	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
	// Заголовок формы--	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	ШаблонСообщения = Нстр("es='Para el objeto de la reparación ""%1"" cerca del coeficiente ""%2"" no es rellenado el campo ""%3"".';ru='Для объекта ремонта ""%1"" у коэффициента ""%2"" не заполнено поле ""%3"".';en='For the repair object ""%1"", the coefficient ""%3"" is not filled in the coefficient ""%2"".'");
	Для каждого СтрокаКоэффициента из Объект.КоэффициентыРемонтныхОсобенностей Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаКоэффициента.ДатаНачалаИспользования) Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрокаКоэффициента.ОбъектРемонта, СтрокаКоэффициента.ВидКоэффициента, НСтр("es='La fecha de la introducción';ru='Дата ввода';en='Date entered'"));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаКоэффициента.ВидКоэффициента) Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрокаКоэффициента.ОбъектРемонта, СтрокаКоэффициента.ВидКоэффициента, НСтр("es='El tipo del coeficiente';ru='Вид коэффициента';en='Coefficient type'"));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
	// Заголовок формы--
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыРемонта
&НаКлиенте
Процедура ОбъектыРемонтаОбъектРемонтаПриИзменении(Элемент)
	
	Если НЕ ДобавлениеОР Тогда
		МассивСтрок = Объект.КоэффициентыРемонтныхОсобенностей.НайтиСтроки(Новый Структура("ОбъектРемонта", СтарыйОР));
		Если НЕ Элементы.ОбъектыРемонта.ТекущиеДанные = Неопределено Тогда
			НовыйОР = Элементы.ОбъектыРемонта.ТекущиеДанные.ОбъектРемонта;
		КонецЕсли;
		
		Для каждого Элем Из МассивСтрок Цикл
			Элем.ОбъектРемонта = НовыйОР;
		КонецЦикла;
	КонецЕсли;
	
	ОбъектыРемонтаПриАктивизацииСтроки(Элементы.ОбъектыРемонта);
	Элементы.ОбъектыРемонта.ЗакончитьРедактированиеСтроки(Ложь);
	//СтарыйОР = Неопределено;
	ДобавлениеОР = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаПриАктивизацииСтроки(Элемент)
	
	Если НЕ Элементы.ОбъектыРемонта.ТекущиеДанные = Неопределено Тогда
		Если ЗначениеЗаполнено(Элементы.ОбъектыРемонта.ТекущиеДанные.ОбъектРемонта) Тогда
			Элементы.КоэффициентыРемонтныхОсобенностей.ОтборСтрок = Новый ФиксированнаяСтруктура("ОбъектРемонта", Элементы.ОбъектыРемонта.ТекущиеДанные.ОбъектРемонта);
			СтарыйОР = Элементы.ОбъектыРемонта.ТекущиеДанные.ОбъектРемонта;
		Иначе
			Элементы.КоэффициентыРемонтныхОсобенностей.ОтборСтрок = Новый ФиксированнаяСтруктура("ОбъектРемонта", ПредопределенноеЗначение("Справочник.торо_ОбъектыРемонта.ПустаяСсылка"));
		КонецЕсли;
			
		Если ТипЗнч(Элементы.ОбъектыРемонта.ТекущиеДанные.ОбъектРемонта) = ТИп("СправочникСсылка.торо_СписокОбъектовРегламентногоМероприятия") Тогда
			Элементы.КоэффициентыРемонтныхОсобенностейИерархия.Видимость = Ложь;
			Элементы.КоэффициентыРемонтныхОсобенностейРаспространятьНаПодчиненных.Видимость = Ложь;
		Иначе
			Элементы.КоэффициентыРемонтныхОсобенностейИерархия.Видимость = Истина;
			Элементы.КоэффициентыРемонтныхОсобенностейРаспространятьНаПодчиненных.Видимость = Истина;
		КонецЕсли;
		
	Иначе
		Элементы.КоэффициентыРемонтныхОсобенностей.ОтборСтрок = Новый ФиксированнаяСтруктура("ОбъектРемонта", Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаОбъектРемонтаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ОбъектыРемонта.ТекущиеДанные;
	
	ОбъектыРемонтаПриАктивизацииСтроки(Элементы.ОбъектыРемонта);
	
	Если НЕ ТекДанные = Неопределено Тогда
		Если ТипЗнч(ТекДанные.ОбъектРемонта) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
			СтандартнаяОбработка = Ложь;     
			СписокДоступныхСтатусов = торо_СтатусыОРВУчете.СписокСтатусовДляПодбора();
			СтарыйОР = ТекДанные.ОбъектРемонта;
			
			ПараметрыОтбора = Новый Структура("СписокСтатусов", СписокДоступныхСтатусов);
			ПараметрыОтбора.Вставить("СтруктураИерархии", ТекСтруктураИерархии);
			ПараметрыОтбора.Вставить("ТекущаяСтрока", СтарыйОР);
			
			ОткрытьФорму("Справочник.торо_ОбъектыРемонта.ФормаВыбора",ПараметрыОтбора,Элемент,,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		ИначеЕсли ТекДанные.ОбъектРемонта = Неопределено Тогда 
			СтандартнаяОбработка = Ложь;
			
			СписокВыбора = ЗаполнитьСписокЗначение();
			
			Если СписокВыбора.Количество() = 1 Тогда     
				
				ОбъектыРемонтаОбъектРемонтаНачалоВыбораЗавершение(СписокВыбора[0], Новый Структура("Элемент", Элемент));
				
			Иначе
				СписокВыбора.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ОбъектыРемонтаОбъектРемонтаНачалоВыбораЗавершение",ЭтотОбъект, Новый Структура("Элемент",Элемент)),НСтр("es='La elección del tipo de datos';ru='Выбор типа данных';en='Data type selection'"));
			КонецЕсли;
			
		Иначе
			СтандартнаяОбработка = Ложь; 
			СтарыйОР = ТекДанные.ОбъектРемонта;
			ФормаВыбора = ПолучитьФорму("Справочник.торо_СписокОбъектовРегламентногоМероприятия.ФормаВыбора",, Элемент, Объект.Ссылка);
			ФормаВыбора.Открыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаОбъектРемонтаНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = ДополнительныеПараметры.Элемент;
	ВыбЭлемент = ВыбранныйЭлемент;
	ТекДанные = Элементы.ОбъектыРемонта.ТекущиеДанные;
	
	Если ВыбЭлемент.Значение = Неопределено Тогда 
		Возврат;
	ИначеЕсли ВыбЭлемент.Значение = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда     
		СписокДоступныхСтатусов = торо_СтатусыОРВУчете.СписокСтатусовДляПодбора();
		СтарыйОР = ТекДанные.ОбъектРемонта;
		
		ПараметрыОтбора = Новый Структура("СписокСтатусов", СписокДоступныхСтатусов);
		ПараметрыОтбора.Вставить("СтруктураИерархии",       ТекСтруктураИерархии);
		
		ОткрытьФорму("Справочник.торо_ОбъектыРемонта.ФормаВыбора",ПараметрыОтбора,Элемент,,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе    
		СтарыйОР = ТекДанные.ОбъектРемонта;
		ФормаВыбора = ПолучитьФорму("Справочник.торо_СписокОбъектовРегламентногоМероприятия.ФормаВыбора",, Элемент, Объект.Ссылка);
		ФормаВыбора.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте

Процедура ОбъектыРемонтаОбъектРемонтаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		НайденныеСтроки = Объект.ОбъектыРемонта.НайтиСтроки(Новый Структура("ОбъектРемонта",ВыбранноеЗначение));
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОбъектыРемонтаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Не Копирование Тогда
		ДобавлениеОР = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаПередУдалением(Элемент, Отказ)
	
	ВыделенныеСтроки = Элементы.ОбъектыРемонта.ВыделенныеСтроки;
	Для каждого УдаляемаяСтрокаИД из ВыделенныеСтроки Цикл
		УдаляемаяСтрока = Объект.ОбъектыРемонта.НайтиПоИдентификатору(УдаляемаяСтрокаИД);
		СтрокиКоэффициентов = Объект.КоэффициентыРемонтныхОсобенностей.НайтиСтроки(Новый Структура("ОбъектРемонта", УдаляемаяСтрока.ОбъектРемонта));
		Для каждого СтрокаКоэффициента из СтрокиКоэффициентов Цикл
			Объект.КоэффициентыРемонтныхОсобенностей.Удалить(СтрокаКоэффициента);
		КонецЦикла;
		
		СтрокиПодчиненных = Объект.КоэффициентыРемонтныхОсобенностейПодчиненных.НайтиСтроки(Новый Структура("РодительИерархии", УдаляемаяСтрока.ОбъектРемонта));
		Для каждого СтрокаПодчиненного из СтрокиПодчиненных Цикл
			Объект.КоэффициентыРемонтныхОсобенностейПодчиненных.Удалить(СтрокаПодчиненного);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаОбъектРемонтаОткрытиеФормыПодбора(ВыбранныйЭлемент, СписокПараметров) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	ИначеЕсли ВыбранныйЭлемент.Значение = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
		ПараметрыФормы = Новый Структура("КлючНазначенияИспользования, ЗакрыватьПриВыборе, СтруктураИерархии", "торо_УстановкаКоэффициентовРемонтныхОсобенностей", Ложь,ТекСтруктураИерархии);
		ОткрытьФорму("Обработка.торо_ПодборОбъектовРемонтныхРабот.Форма.ФормаПодбораОбъектовДляПланаГрафикаППР",
						ПараметрыФормы, Элементы.ОбъектыРемонта, ЭтаФорма.УникальныйИдентификатор);												
	ИначеЕсли ВыбранныйЭлемент.Значение = Тип("СправочникСсылка.торо_СписокОбъектовРегламентногоМероприятия") Тогда
		ПараметрыФормы = Новый Структура("КлючНазначенияИспользования, ЗакрыватьПриВыборе, СтруктураИерархии", "торо_УстановкаКоэффициентовРемонтныхОсобенностей", Ложь,ТекСтруктураИерархии);
		ОткрытьФорму("Обработка.торо_ПодборОбъектовРемонтныхРабот.Форма.ФормаПодбораСписковОРДляГрафикаРегламентныхМероприятий",
						ПараметрыФормы, Элементы.ОбъектыРемонта, ЭтаФорма.УникальныйИдентификатор);																		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда		
		Возврат;
	ИначеЕсли ВыбранноеЗначение.Свойство("ОбъектРемонта") Тогда
		Для каждого ВыбранныйОР Из ВыбранноеЗначение.ОбъектРемонта Цикл
			Если ТипЗнч(ВыбранныйОР) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
				МассивОРСовпадающихСВыбранным = Объект.ОбъектыРемонта.НайтиСтроки(Новый Структура("ОбъектРемонта",ВыбранныйОР));
				Если МассивОРСовпадающихСВыбранным.Количество() = 0 Тогда 
					НоваяСтрока = Объект.ОбъектыРемонта.Добавить();
					НоваяСтрока.ОбъектРемонта = ВыбранныйОР;
				КонецЕсли;				
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ВыбранноеЗначение.Свойство("Дерево") Тогда 	
		Для каждого ВыбранныйСписокОРДляРМ Из ВыбранноеЗначение.Дерево.ПолучитьЭлементы() Цикл
			МассивСписокОРДляРМСовпадающихСВыбранным = Объект.ОбъектыРемонта.НайтиСтроки(Новый Структура("ОбъектРемонта",ВыбранныйСписокОРДляРМ.Объект));
			Если МассивСписокОРДляРМСовпадающихСВыбранным.Количество() = 0 Тогда
				НоваяСтрока = Объект.ОбъектыРемонта.Добавить();
				НоваяСтрока.ОбъектРемонта = ВыбранныйСписокОРДляРМ.Объект;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКоэффициентыРемонтныхОсобенностей
&НаКлиенте
Процедура КоэффициентыРемонтныхОсобенностейПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.КоэффициентыРемонтныхОсобенностей.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		флагИспользование = Элементы.КоэффициентыРемонтныхОсобенностей.ТекущиеДанные.Использование;
		Элементы.КоэффициентыРемонтныхОсобенностейЗначениеКоэффициента.Доступность = флагИспользование;
		
		ТекВидКоэф = ТекДанные.ВидКоэффициента;
		ТекДатаНачИсп = ТекДанные.ДатаНачалаИспользования;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентыРемонтныхОсобенностейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока и НЕ Копирование Тогда
		Если НоваяСтрока И Элементы.ОбъектыРемонта.ТекущиеДанные <> Неопределено Тогда
			Элементы.КоэффициентыРемонтныхОсобенностей.ТекущиеДанные.ОбъектРемонта = Элементы.ОбъектыРемонта.ТекущиеДанные.ОбъектРемонта;
		КонецЕсли;
		Элементы.КоэффициентыРемонтныхОсобенностей.ТекущиеДанные.Использование = Истина;
		КоэффициентыРемонтныхОсобенностейИспользованиеПриИзменении(Элементы.КоэффициентыРемонтныхОсобенностей);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентыРемонтныхОсобенностейПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТекСтр = Элементы.КоэффициентыРемонтныхОсобенностей.ТекущиеДанные;
	Если НЕ ОтменаРедактирования Тогда
		Если НоваяСтрока И Элементы.ОбъектыРемонта.ТекущиеДанные <> Неопределено Тогда
			ТекСтр.ОбъектРемонта = Элементы.ОбъектыРемонта.ТекущиеДанные.ОбъектРемонта;
		КонецЕсли;
		МассивСтрок = Объект.КоэффициентыРемонтныхОсобенностей.НайтиСтроки(Новый Структура("ОбъектРемонта, ВидКоэффициента, ДатаНачалаИспользования",ТекСтр.ОбъектРемонта, ТекСтр.ВидКоэффициента, ТекСтр.ДатаНачалаИспользования));
		Если МассивСтрок.Количество() > 1 Тогда
			ШаблонСообщения = НСтр("es='Para el objeto de la reparación %1 es establecido ya el tipo del coeficiente %2 (¡con %3)!';ru='Для объекта ремонта %1 уже установлен вид коэффициента %2 (с %3)!';en='For repair object%1, the coefficient type%2 (with%3) has already been set!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекСтр.ОбъектРемонта, ТекСтр.ВидКоэффициента, ТекСтр.ДатаНачалаИспользования);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентыРемонтныхОсобенностейРаспространятьНаПодчиненныхПриИзменении(Элемент)
	
	ТекДанные = Элементы.КоэффициентыРемонтныхОсобенностей.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекДанные.Иерархия) Тогда
		ТекДанные.РаспространятьНаПодчиненных= НЕ ТекДанные.РаспространятьНаПодчиненных;
		ТекстСообщения = НСтр("es='de la jerarquía.';ru='Не заполнено значение структуры иерархии.';en='The value of the hierarchy structure is not filled.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентыРемонтныхОсобенностейИспользованиеПриИзменении(Элемент)
	
	флагИспользование = Элементы.КоэффициентыРемонтныхОсобенностей.ТекущиеДанные.Использование;
	Если флагИспользование Тогда 
		Элементы.КоэффициентыРемонтныхОсобенностейЗначениеКоэффициента.Доступность = Истина;
	Иначе
		Элементы.КоэффициентыРемонтныхОсобенностейЗначениеКоэффициента.Доступность = Ложь;
		Элементы.КоэффициентыРемонтныхОсобенностей.ТекущиеДанные.ЗначениеКоэффициента = ПредопределенноеЗначение("Справочник.торо_ВидыКоэффициентовРемонтныхОсобенностей.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подбор(Команда)
	СписокВыбора = ЗаполнитьСписокЗначение();
	Если СписокВыбора.Количество() = 1 Тогда     		
		ОбъектыРемонтаОбъектРемонтаОткрытиеФормыПодбора(ЭтотОбъект,);		
	Иначе
		СписокВыбора.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ОбъектыРемонтаОбъектРемонтаОткрытиеФормыПодбора",ЭтотОбъект),НСтр("es='La elección del tipo de datos';ru='Выбор типа данных';en='Data type selection'"));
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервереБезКонтекста
Функция ЗаполнитьСписокЗначение()
	
	ФОИспользоватьРегламентныеМероприятия = ПолучитьФункциональнуюОпцию("торо_ИспользоватьРегламентныеМероприятия");
	
	СписокВыбора = Новый СписокЗначений;
	
	Для Каждого ТипРеквизита Из Метаданные.Документы.торо_УстановкаКоэффициентовРемонтныхОсобенностей.ТабличныеЧасти.ОбъектыРемонта.Реквизиты.ОбъектРемонта.Тип.Типы() Цикл
		Если Не ФОИспользоватьРегламентныеМероприятия И ТипРеквизита = Тип("СправочникСсылка.торо_СписокОбъектовРегламентногоМероприятия") Тогда
	
			Продолжить;
		
		КонецЕсли;
	
		СписокВыбора.Добавить(ТипРеквизита);
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаКлиенте
Процедура ОбъектыРемонтаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Копирование Тогда
		текДанные = Элементы.ОбъектыРемонта.ТекущиеДанные;
		текДанные.ОбъектРемонта = ПредопределенноеЗначение("Справочник.торо_ОбъектыРемонта.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаОбъектРемонтаОчистка(Элемент, СтандартнаяОбработка)
	Если Элементы.ОбъектыРемонта.ТекущиеДанные <> Неопределено Тогда
		ТекущийОР = Элементы.ОбъектыРемонта.ТекущиеДанные;
		
		СтрокиКоэффициентов = Объект.КоэффициентыРемонтныхОсобенностей.НайтиСтроки(Новый Структура("ОбъектРемонта", ТекущийОР.ОбъектРемонта));
		Для каждого СтрокаКоэффициента из СтрокиКоэффициентов Цикл
			Объект.КоэффициентыРемонтныхОсобенностей.Удалить(СтрокаКоэффициента);
		КонецЦикла;
		
		СтрокиПодчиненныхНаУдаление = Объект.КоэффициентыРемонтныхОсобенностейПодчиненных.НайтиСтроки(Новый Структура("РодительИерархии", ТекущийОР.ОбъектРемонта));
		
		Для Каждого СтрокаПодчиненного Из СтрокиПодчиненныхНаУдаление Цикл 
			Объект.КоэффициентыРемонтныхОсобенностейПодчиненных.Удалить(СтрокаПодчиненного);
		КонецЦикла;
	
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");	
	
КонецПроцедуры

#КонецОбласти
